import { Container } from "../UI/Container/Container";
import styles from "./PrivacyPolicy.module.css";

const PrivacyPolicy = () => {
    return (
        <Container>
            <div className={styles.privacy}>
                <h2 className={styles.privacy_title}>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ДЛЯ TRACTOR.APP</h2>
                <p className={styles.privacy_paragraph}>1. ОПРЕДЕЛЕНИЕ ПОНЯТИЙ</p>
                <p className={styles.privacy_paragraph}>
                    {"\"Закон\" означает закон Республики Казахстан \" О персональных данных и их защите \" со всеми изменениями и дополнениями, а также иные законодательные акты Республики Казахстан."}
                </p>
                <p className={styles.privacy_paragraph}>
                    Zabotik.kz — это интернет-сайт, доступный по адресу https://zabotik.kz/  (включая все уровни домена) через полную и мобильную версии представляющий собой совокупность содержащихся в информационной системе объектов интеллектуальной собственности и информации (административного и пользовательского контента).
                    Zabotik.kz представляет собой сайт осуществляющий хранение медицинских данных и обеспечивающий коммуникацию между врачами-педиатрами и родителями их пациентов.
                </p>
                <p className={styles.privacy_paragraph}>
                    &quot;Персональные данные&quot; означает совокупность личных данных и/или неперсонифицированной информации о Пользователе, предоставляемую им самим Правообладателю и/или автоматически собираемую Правообладателем и/или третьими лицами.
                </p>
                <p className={styles.privacy_paragraph}>
                    &quot;Политика&quot; означает настоящею Политику конфиденциальности мобильного приложения (со всеми существующими дополнениями и изменениями).
                    &quot;Пользователь&quot; означает физическое лицо, которое зарегистрировалось и стало посетителем интернет-сайта.
                </p>
                <p className={styles.privacy_paragraph}>
                    &quot;Пользовательское соглашение&quot; означает соглашение, заключаемое между Правообладателем и Пользователем в отношении порядка, правил и особенностей использования сайта. Пользователь присоединяется к такому соглашению и не имеет права вносить и/или требовать внесения в него каких-либо изменений или дополнений.
                    &quot;Правообладатель&quot; означает следующее лицо, которому принадлежат исключительные права владения Мобильным приложением, интернет сайтом ТОО «IT Solutions».
                    &quot;Файлы куки&quot; означает небольшие файлы, отправляемые сайтом, и размещаемые на устройствах Пользователя, для улучшения работы сайт, а также качества размещенного в них контента.
                </p>
                <p className={styles.privacy_paragraph}>
                    2. ОТНОШЕНИЯ, НА КОТОРЫЕ РАСПРОСТРАНЯЕТСЯ ПОЛИТИКА
                </p>
                <p className={styles.privacy_paragraph}>
                    Общие положения
                    Данная Политика используется и применима исключительно к Персональным данным, получаемым от Пользователя в связи с использованием им сайта.
                </p>
                <p className={styles.privacy_paragraph_ui}>
                    Положения данной Политики направлены на:
                </p>
                <ul className={styles.privacy_ul}>
                    <li>
                        -  определение видов и типов получаемых Персональных данных, направлений и целей использования (обработки) Персональных данных, а также источников получения таких Персональных данных; и
                    </li>
                    <li>
                        - определение прав Пользователя в отношении защиты конфиденциальности передаваемых им Персональных данных; и
                    </li>
                    <li>
                        - определение лиц, ответственных за обработку и хранение Персональных данных, а также третьих лиц, которым такие данные раскрываются (полностью или частично).
                    </li>
                </ul>
                <p className={styles.privacy_paragraph}>
                    Правила настоящей Политики не применяются в случае обработки третьими лицами Персональных данных, которые добровольно предоставляются Пользователем.
                    Посредством посещении интернет сайта.
                </p>
                <p className={styles.privacy_paragraph}>
                    Пользователь соглашается с условиями данной Политики и дает свое согласие Правообладателю на сбор, обработку, удержание и хранение Персональных данных в порядке и на условиях, предусмотренных настоящей Политикой.
                </p>
                <p className={styles.privacy_paragraph}>
                    Если Пользователь не согласен с условиями Политики и/или отдельные условия Политики ему не понятны, в таком случае Пользователь обязан немедленно прекратить посещение интернет-сайта.
                </p>
                <p className={styles.privacy_paragraph_ui}>
                    Права пользователя по защите персональных данных
                    В связи с предоставлением Персональных данных Пользователь автоматически получает следующие права:
                </p>
                <ul className={styles.privacy_ul}>
                    <li>
                        - получать данные, касающиеся их обработки (основания и цели такой обработки, применяемые способы обработки, сведения о лицах, которые имеют доступ к ним или которым они могут быть раскрыты на основании договора или Закона).
                    </li>
                    <li>
                        - получать данные о месте нахождения и идентификационных данных лиц, совершающих обработку Персональных данных.
                    </li>
                    <li>
                        - получать данные о сроках хранения Персональных данных.
                    </li>
                    <li>
                        - получать данные об осуществленной или о предполагаемой трансграничной передаче Персональных данных.
                    </li>
                    <li>
                        - получать информацию о месте нахождения и идентификационных данных лиц, совершающих хранение Персональных данных.
                    </li>
                    <li>
                        - обжаловать действия или бездействие Правообладателя в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке.
                    </li>
                </ul>
                <p className={styles.privacy_paragraph}>
                    3. ПЕРЕЧЕНЬ СОБИРАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ
                </p>
                <p className={styles.privacy_paragraph_ui}>
                    Неперсонифицированная информация о пользователях
                    В связи с использованием интернет сайта Правообладатель может автоматически собирать и обрабатывать следующею неперсонифицированную информацию о Пользователе:
                </p>
                <ul className={styles.privacy_ul}>
                    <li>
                        - информацию о трафике, возможном количестве совершенных кликов, логи и другие данные.
                    </li>
                    <li>
                        - информацию о местонахождении Пользователя (геолокация). Пользователь может в любой момент отключить геолокацию путем изменения настроек устройства, с которого осуществлен вход на интернет-сайт.
                    </li>
                    <li>
                        - информацию об устройстве (идентификационный номер, сеть мобильного оператора), с которого выполняется вход, операционная система, платформа, тип браузера и другая информация о браузере, IP адрес.
                    </li>
                </ul>
                <p className={styles.privacy_paragraph_ui}>
                Личные данные о пользователях
                Пользователь предоставляет Правообладателю о себе следующие личные данные:
                </p>
                <ul className={styles.privacy_ul}>
                    <li>- полные фамилию, имя и отчество.</li>
                    <li>- номер мобильного телефона.</li>
                    <li>- адрес электронной почты</li>
                    <li>- фотографию с изображением Пользователя по желанию Пользователя и размещения в личном кабинете.</li>
                    <li>
                        - данные, которые содержатся в личном кабинете (профиле) Пользователя, все внутренние переписки Пользователя (если есть), а также иная активность личного кабинета (профиля) Пользователя.
                    </li>
                    <li>- медицинские данные ребенка, включая выписки из роддома, заключения других врачей, результаты анализов.</li>
                    <li>
                        - данные о совершенных Пользователям заказах/покупках и/или полученных/оплаченных услугах через интернет-сайт.
                    </li>
                    <li>
                        -  данные о всех совершенных Пользователем публикациях на сайте, включая сообщения, комментарии и отзывы.
                    </li>
                    <li>
                        -  данные и информация, получаемая в результате объединения тех или иных Персональных данных конкретного Пользователя, а также данные и информация, получаемые данные о Пользователе, получаемые от третьих лиц (партнеров, маркетологов, исследователей).
                    </li>
                </ul>
                <p className={styles.privacy_paragraph}>
                    Пользователь является единственным ответственным лицом за полноту предоставляемых личных (персональных) данных и обязан осуществлять своевременное их изменение (обновление, проверку, корректировку) на регулярной основе.
                    Правообладатель исходит из того, что все предоставленные Пользователем личные (персональные) данные являются достоверными, и что Пользователь поддерживает такую информацию в актуальном состоянии.
                </p>
                <p className={styles.privacy_paragraph}>
                    Информация о совершаемых транзакциях
                    Пользователь через интернет-сайт может осуществлять оплату за подписку на пользование интернет-сайтом посредством введения в специальное поле информации о платежной карте и идентификационных данных собственника такой карты. 
                </p>
                <p className={styles.privacy_paragraph}>
                    Сбор и обработка данных о Пользователе в данном случае осуществляется исключительно для целей проведения оплаты, недопущения мошенничества, а также соблюдения иных требований Закона.
                </p>
                <p className={styles.privacy_paragraph}>
                    Пользователь дает свое согласие на доступ и сбор Правообладателем и соответствующей платежной системой или банковским учреждением, через которую/которое проводится оплата, к таким Персональным данным, а также соглашается с политикой конфиденциальности соответствующей платежной системы или банковского учреждения.
                </p>
                <p className={styles.privacy_paragraph_ui}>
                    Использование файлов куки
                    Данный интернет сайт применяет следующие Файлы куки: 
                </p>
                <ul className={styles.privacy_ul}>
                    <li>
                        - Технические (функциональные) Файлы куки, которые нужны для контроля трафика и передачи данных, для идентификации Пользователей и предоставления доступа Пользователю к контенту интернет сайта и без которых использование интернет-сайта является функционально ограниченным.
                    </li>
                    <li>
                        - Статистические Файлы куки, которые нужны для отслеживания частоты посещаемости сайта Пользователями, для выявления способов использования Пользователем интернет-сайта, а также для выявления типа и вида контента, который является популярными или интересным для Пользователя.
                    </li>
                    <li>
                        - Геолокационные Файлы куки, которые нужны для определения места нахождения Пользователя для персонализации выводимого на экран его устройства контента.
                    </li>
                    <li>
                        - Файлы куки третьих лиц, которые устанавливаются третьими лицами с разрешения Пользователя и предназначены для проведения статистических исследований, касающихся поведения Пользователя в сети Интернет и/или направления персонализиированных рекламных или маркетинговых материалов Пользователю и/или предоставления товаров или услуг.
                    </li>
                </ul>
                <p className={styles.privacy_paragraph}>
                    Пользователь имеет право в любой момент отключить Файлы куки путем обращения в адрес Правообладателя в службу поддержки. 
                </p>
                <p className={styles.privacy_paragraph}>
                    4. ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
                </p>
                <p className={styles.privacy_paragraph_ui}>
                    Определение целей обработки
                    Сбор и обработка Персональных данных осуществляется в следующих целях:
                </p>
                <ul className={styles.privacy_ul}>
                    <li>
                        - для анализа поведения Пользователя, а также выявления предпочтений Пользователя к определенному виду контента.
                    </li>
                    <li>
                        - для оперативной и корректной работы интернет-сайта, улучшения функционирования работы интернет сайта, улучшения контента интернет сайта, улучшения внутренней архитектуры и функциональности интернет сайта.
                    </li>
                    <li>
                        - для идентификации Пользователя.
                    </li>
                    <li>
                        - для предоставления персонализированных рекламных и маркетинговых материалов.
                    </li>
                    <li>
                        - для направления персонализированных рекламных и маркетинговых материалов на указанный электронный адрес и/или мобильный телефон Пользователя.
                    </li>
                    <li>
                        - для соблюдения требований Закона.
                    </li>
                    <li>
                        - для отслеживания заказов/покупок, совершенных Пользователем через интернет сайт.
                    </li>
                    <li>
                        - для определения места нахождения Пользователя.
                    </li>
                    <li>
                        - для технической поддержки интернет сайта, выявления проблем в его работе и их устранение.
                    </li>
                    <li>
                        - для поддержания связи с Пользователем (коммуникация).
                    </li>
                    <li>
                        - для выполнения иных обязательств Правообладателя, которые возникли перед Пользователем.
                    </li>
                    <li>
                        - для проведения статистических исследований.
                    </li>
                    <li>
                        - для любых других целей, при условии получения отдельного согласия от Пользователя.
                    </li>
                </ul>
                <p className={styles.privacy_paragraph}>
                    Обработка Персональных данных осуществляется на основе принципов: законности целей и способов обработки; и добросовестности; и соответствия целей обработки Персональных данных целям, заранее определенным и заявленным при сборе таких Персональных данных; и соответствия объема и характера обрабатываемых Персональных данных заявленным целям их обработки.
                </p>
                <p className={styles.privacy_paragraph}>
                    Условия обработки персональных данных
                    Обработка Персональных данных проводится в случаях: получения согласия от Пользователя; или достижения Правообладателем целей, предусмотренных 
                </p>
            </div>
        </Container>
    );
};

export default PrivacyPolicy;